moments/lei.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2016-10-13 Thu 22:42 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="viewport" content="width=device-width, initial-scale=1" />
<title>老黄其人 &#x2014; 记我的微积分老师黄兆镇教授雷语雷事</title>
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Dingxin Zhang" />
<link rel="stylesheet" type="text/css" href="../minimal.css" />
</head>
<body>
<div id="content">
<h1 class="title">老黄其人 &#x2014; 记我的微积分老师黄兆镇教授雷语雷事</h1>
<p>
转载: 文／佚名
</p>

<p>
黄兆镇教授是我的微积分老师，本应该尊称他为黄老，但还是叫老黄感觉亲切一些。
</p>

<p>
老黄是一个把子集读作“几值”，把极值读作&ldquo;子集&rdquo;的人。在今天的浙大看来其人对学生的要求算得上十分严厉。上课的第一天，他说八点钟之前作业要放在讲台上，否则一律不收，上课不允许迟到早退，不允许讲话交谈，不允许手机响，“否则我就扔出去了”。
</p>

<p>
撇开他雷人的普通话不说，老黄确实是很好很负责的老师。上课条理清晰，并且补充大量的数学史及世界文明史知识。他说积分的符号来源于小提琴的内轮廓，告诉我们δ读作 “si”，并因为由笛卡尔引申出的话题而用了一节课时间探究欧洲各国的人名的来源。
</p>

<p>
老黄对浙大的各方面都有很多不满，或许是爱校心切。“浙大现在是世界五流，连四流都算不上”——老黄如是说，“浙大还说要在2020年建设成为国际一 流大学，我看再过3000年都不行，再过4000年可能可以。”“杰个，浙大的学生从入学，（他在黑板上画了个小人）在学校里走完一系列程序（他又画了个 方框里面套着很多方框），就是上一些毫无关联的课，然后就毕业出来了（又画了一个人）。浙大的毕业生80％都是垃圾，某某师范大学的毕业生99％都是垃 圾。”“我们用的教材也是垃圾，我只是从垃圾中挑选一个垃圾而已。”“杰个粉笔一写就断，我已经投诉了十几年了，从来没有换过，他们觉得杰个牌子好，拿的 回扣多么。（然后拿起一支新粉笔写字，粉笔应声而断）”“我从来不收系前三名作为研究生。”
</p>

<p>
老黄是个热爱祖国热爱母语的人，他用不甚纯熟的汉语义正辞严地对咱班加拿大人说：“请你们学好汉语再来上我的课。”老黄有时候脾气很大，下面发出一点响声就会转过身瞪红双眼单手握拳敲讲台，有学生不幸迟到被他赶出去“我早就说了，杰个课不允许迟到。”
</p>

<p>
More about him:
</p>

<p>
老黄最爱穿蓝色T恤戴茶色大墨镜嘴上叼根烟背上背大背包缓步在教室之间穿行。据闻普通话是他学的第五或第六或第七门语言，据闻他说的是港式普通话，但 经我证实得出的结论是绝对没有这么雷人的港式普通话，根本连我都听不懂嘛，最后得知他的普通话是跟一个福建人学的，咱班福建人robin说他听着还好啊， 从而证实了此说法的真实性。
</p>
</div>
</body>
</html>
